/*
// Запрашиваем значение x у пользователя через всплывающее окно
let x = parseFloat(prompt("Введите значение x:"));

// Вычисляем значение функции
let y = 17 * Math.pow(x, 2) - 6 * x + 13;

// Выводим результат в другое всплывающее окно
alert("При x = " + x + ", значение функции y = " + y);

// Также выводим результат в консоль (для просмотра через F12)
console.log("При x = " + x + ", значение функции y = " + y);    //2.1 a)
*/

let a = parseFloat(prompt("Введите значение a:"));

let y = 3 * Math.pow(a, 2) + 5 * a - 21;

alert("При a = " + a + ", значение функции y = " + y);

console.log("При a = " + a + ", значение функции y = " + y);    //2.1 b)



